# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\run1009\Documents\Mesh_Flood_DIR_Sensor\Mesh_Flood_DIR_Sensor.cydsn\Mesh_Flood_DIR_Sensor.cyprj
# Date: Mon, 13 Aug 2018 08:45:57 GMT
#set_units -time ns
create_clock -name {UART_SCBCLK(FFB)} -period 4312.5 -waveform {0 2156.25} [list [get_pins {ClockBlock/ff_div_1}]]
create_clock -name {CyRouted1} -period 62.5 -waveform {0 31.25} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyLFCLK} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyECO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/eco}]]
create_clock -name {CyIMO} -period 62.5 -waveform {0 31.25} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 62.5 -waveform {0 31.25} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 62.5 -waveform {0 31.25} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 69 139} [list]
create_generated_clock -name {PrISM_Clock} -source [get_pins {ClockBlock/hfclk}] -edges {1 161 321} [list [get_pins {ClockBlock/udb_div_1}]]
create_generated_clock -name {Clock_Glitch} -source [get_pins {ClockBlock/hfclk}] -edges {1 16001 32001} [list [get_pins {ClockBlock/udb_div_3}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\run1009\Documents\Mesh_Flood_DIR_Sensor\Mesh_Flood_DIR_Sensor.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\run1009\Documents\Mesh_Flood_DIR_Sensor\Mesh_Flood_DIR_Sensor.cydsn\Mesh_Flood_DIR_Sensor.cyprj
# Date: Mon, 13 Aug 2018 08:45:53 GMT
